print('=========Типы данных=========')
# Напишите программу, которая принимает число и определяет, является ли оно целым, вещественным или строкой.

# Создайте переменную с числом, преобразуйте её в строку, а затем обратно в число. Проверьте их типы.

# Примите с клавиатуры два числа и выведите их сумму, разность и произведение.

# Преобразуйте строку "123.45" в вещественное число и проверьте, можно ли выполнить математические операции.

# Проверьте, является ли введённое значение булевым (True или False).

print('=========Строки=========')

# Напишите программу, которая проверяет, является ли введённая строка палиндромом.

# Подсчитайте количество вхождений символа "а" в строке.

# Разделите строку "яблоко, груша, банан" на список слов.

# Примите строку, замените в ней все пробелы на символ "-".

# Найдите самое длинное слово в строке.

print('=========Коллекции=========')

# Создайте множество из строки "aabbccddeeff", чтобы удалить дубликаты символов.

# Найдите пересечение двух множеств: {1, 2, 3, 4} и {3, 4, 5, 6}.

# Объедините два множества: {1, 2} и {3, 4}.

# Проверьте, является ли одно множество подмножеством другого: {1, 2} ⊆ {1, 2, 3}.

# Удалите случайный элемент из множества и выведите оставшиеся элементы.

print('=========Списки, кортежи, словари=========')

# Примите 5 чисел и сохраните их в список. Выведите их сумму и среднее значение.

# Создайте кортеж из 5 слов. Попробуйте заменить одно из слов (объясните, почему это невозможно).

# Составьте словарь с ключами от 1 до 5 и значениями их квадратов.

# Найдите максимальное значение в списке и его индекс.

# Сортируйте словарь по значениям.

print('=========Срезы=========')

# Создайте список из чисел от 1 до 10 и выведите только чётные элементы.

# Выведите последние 3 элемента списка [1, 2, 3, 4, 5].

# Разверните строку "hello" с помощью среза.

# Выведите каждый второй элемент списка [10, 20, 30, 40, 50].

# Скопируйте список через срез и добавьте к нему ещё несколько элементов.

print('=========Генераторы=========')

# Создайте генератор для чисел от 1 до 10, возводя каждое в квадрат.

# Напишите генератор, который возвращает только чётные числа из списка [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].

# Сгенерируйте список строк "Number 1", "Number 2", ..., "Number 5".

# Создайте генератор, возвращающий бесконечную последовательность чисел (остановите после 10 чисел).

# Используйте генератор для вычисления факториала чисел от 1 до 5.
print('=========Даты и время=========')

# Получите текущую дату и время и выведите их.
# Напишите программу, которая принимает дату и определяет, какой это был день недели.
# Выведите дату следующей недели относительно текущей даты.
# Вычислите разницу в днях между двумя датами.
# Считайте строку в формате "22-09-2022" и преобразуйте её в объект datetime.
print('=========Функции=========')

# Напишите функцию, которая принимает два числа и возвращает их сумму.
# Создайте функцию, которая проверяет, является ли строка палиндромом.
# Напишите функцию, которая возвращает факториал числа.
# Реализуйте функцию, которая принимает список и возвращает его максимальный элемент.
# Напишите функцию, которая принимает два списка и возвращает список их общих элементов.

print('=========Аргументы=========')

# Напишите функцию, которая принимает произвольное количество чисел и возвращает их сумму.
# Реализуйте функцию, которая принимает два обязательных и один необязательный аргумент.
# Напишите функцию, которая принимает словарь с ключами и значениями и выводит их в формате "ключ: значение".
# Создайте функцию, принимающую позиционные и именованные аргументы одновременно.
# Напишите функцию, которая принимает список строк и добавляет к каждой строке суффикс "!".

print('=========Распаковка и анонимные функции=========')

# Создайте список и используйте распаковку, чтобы вывести его элементы через запятую.
# Напишите lambda-функцию, которая принимает число и возвращает его квадрат.
# Используйте map и анонимную функцию, чтобы преобразовать список чисел в их квадраты.
# Примените распаковку к словарю, чтобы передать его элементы в функцию.
# Напишите программу, которая принимает список строк и сортирует их по длине с использованием lambda.